# set arguments for all 'brew install --cask' commands
cask_args appdir: "/Applications", require_sha: true

tap "dotenvx/brew"
tap "homebrew/bundle"

brew "bat"
brew "fd"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-extras"
brew "go"
brew "httpie"
brew "jq"
brew "neovim"
brew "node"
brew "pnpm"
brew "ripgrep"
brew "rust"
brew "shfmt"
brew "starship"
brew "tmux"
brew "tree"
brew "wget"
brew "watch"
brew "xh"
brew "yazi"
brew "zoxide"
brew "dotenvx/brew/dotenvx"
brew "mas"

cask "alacritty"
cask "slack"
cask "raycast"
cask "1password"
cask "zed"
cask "visual-studio-code"
