tap "dotenvx/brew"
tap "homebrew/bundle"
brew "bat"
brew "colordiff"
brew "fd"
brew "fish"
brew "fnm"
brew "fx"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-extras"
brew "gnupg"
brew "go"
brew "httpie"
brew "jq"
brew "luacheck"
brew "mas"
brew "tree-sitter"
brew "tig"
brew "neovim"
brew "node"
brew "pnpm"
brew "ripgrep"
brew "rust"
brew "shfmt"
brew "starship"
brew "stylua"
brew "tig"
brew "tmux"
brew "tree"
brew "unbound"
brew "watch"
brew "wget"
brew "xh"
brew "yazi"
brew "zoxide"
brew "dotenvx/brew/dotenvx"
cask "1password", args: { appdir: "/Applications" }
cask "alacritty", args: { appdir: "/Applications" }
cask "input-source-pro", args: { appdir: "/Applications" }
cask "orbstack", args: { appdir: "/Applications" }
cask "raycast", args: { appdir: "/Applications" }
cask "slack", args: { appdir: "/Applications" }
cask "visual-studio-code", args: { appdir: "/Applications" }
cask "zed", args: { appdir: "/Applications" }
mas "Amphetamine", id: 937984704
mas "Microsoft To Do", id: 1274495053
mas "Paste", id: 967805235
mas "Xcode", id: 497799835
