# set arguments for all 'brew install --cask' commands
cask_args appdir: "/Applications", require_sha: true

tap "dotenvx/brew"
tap "homebrew/bundle"

brew "bat"
brew "certifi"
brew "fd"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-extras"
brew "go"
brew "httpie"
brew "jq"
brew "libgit2"
brew "neovim"
brew "node"
brew "pnpm"
brew "ripgrep"
brew "rust"
brew "shfmt"
brew "starship"
brew "tmux"
brew "tree"
brew "wget"
brew "watch"
brew "xh"
brew "yazi"
brew "zoxide"
brew "dotenvx/brew/dotenvx"

cask "alacritty"
cast "alacritty"
cask "raycast"
cask "1password"
cask "zed"

vscode "antfu.file-nesting"
vscode "apollographql.vscode-apollo"
vscode "bierner.emojisense"
vscode "bradlc.vscode-tailwindcss"
vscode "chakrounanas.turbo-console-log"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "hoovercj.vscode-dimmer"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "redhat.vscode-yaml"
vscode "softwaredotcom.swdc-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "tabnine.tabnine-vscode"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "vue.volar"
